print(999 ** 999)   # ** 거듭제곱
print(999 / 4)  # 나누기
print(999 // 4) # 몫
print(999 % 4)  # 나머지
print(--999)    # 쌍부호 => 원래부호
print((-32+96)*12/3)                    #연습문제 2-1
print(3*4-((-27+67)/4)**8)              #연습문제 2-2
print(((512+1968-432)/(2**4))+128)        #연습문제 2-3

print(256==(2**8))
print((50+50)<=(10*10))
print((99)!=(10**2-1))
print(abs(10))     #절댓값
print(abs(-10))

print(round(3.141527))#반올림 (정수로), 무입력값 0으로 입력
print(round(3.141527,2))#소수반올림 / 소수점 둘째 자리까지 반올림
print(round(3.141527,4))#소수반올림 / 소수점 넷째 자리까지 반올림
print(round(10/6))        # 10/6 을 정수로 반올림

import math

print(round(math.sqrt(3),2))
